---
kind: type
id: T:Autodesk.Revit.DB.Sketch
source: html/a7f463ef-1bb4-d7b7-a988-ddcbc3838a6e.htm
---
# Autodesk.Revit.DB.Sketch

Provides access to the Sketch in Autodesk Revit.

## Syntax (C#)
```csharp
public class Sketch : SketchBase
```